app/controllers/financials_controller.rb

  def new
    if current_user && current_user.financials.size > 0
---
SELECT `financials`.* FROM `financials` INNER JOIN `questions` ON `financials`.id = `questions`.financial_id WHERE ((`questions`.user_id = 1)) ORDER BY created_at desc LIMIT 1

  def final
    #I don't why the before filter is not ending the chain if the session is nil
    #Thats why I have to catch it here and kick out the user
    unless ensure_user_and_financial_exists
      flash[:error] = 'You session has expired for security reasons. Please start again. <br/> We are sorry for the incovenience.'
      redirect_to :controller => :questions, :action => :new and return
    end
    #If you are here all validation has passed
    #Create and save both Question and Financial models from session objects
    @financial = session[:new_financial]
    @question = session[:new_question_item]
    @question_payment = session[:new_question_payment]

    #@question.pm_saving = @question_payment.pm_saving
    #@question.pm_investment = @question_payment.pm_investment
    #@question.pm_financing = @question_payment.pm_financing
    @question.pm_saving_amount = @question_payment.pm_saving_amount
    @question.pm_investment_amount = @question_payment.pm_investment_amount
    @question.pm_financing_amount = @question_payment.pm_financing_amount
    @question.age = @question_payment.age
    @question.nick_name = @question_payment.nick_name
    @question.reason_to_buy = @question_payment.reason_to_buy

    if current_user
      @question.user_id = current_user.id
      @financial.user_id = current_user.id
    end

    if @financial.save
        @question.financial_id = @financial.id
        if @question.save
---
INSERT INTO `financials` (`cc_interest_rate`, `cc_debt`, `created_at`, `investments`, `net_income`, `updated_at`, `retirement_savings`, `mortage_payment`, `total_expenses`, `monthly_retirement_contribution`, `car_loan_payment`, `user_id`, `deferred_loan_amount`, `student_loan_payment`, `other_loan_payment`, `gross_income`, `liquid_assets`) VALUES(0, 0, '2010-10-21 01:37:20', 0, 2500, '2010-10-21 01:37:20', 0, 0, 2000, 500, 0, NULL, 0, 0, 0, 3000, 20000)
INSERT INTO `questions` (`reason_to_buy`, `created_at`, `tos`, `expert_verdict`, `updated_at`, `pm_investment`, `recurring_item_cost`, `pm_financing_amount`, `pm_investment_amount`, `expert_details`, `item_name`, `user_id`, `financial_id`, `pm_saving_amount`, `nick_name`, `item_cost`, `pm_saving`, `age`, `pm_financing`) VALUES(1, '2010-10-21 02:00:12', 0, NULL, '2010-10-21 02:00:12', 0, 0, 0, 0, NULL, 'test', NULL, 3, 100, 'satishf', 100, 1, 35, 0)

  def capture_additional_data
      #Ask for email to send the expert_opinion and password to save the financial_data
      @question = Question.find(params[:id])
---
SELECT * FROM `questions` WHERE (`questions`.`id` = 1)

  def create_account
    #TODO Send report and create user account
    #email = params[:email]
    @question = Question.find(params[:id])
    @error_msg = ""

    nick_name = params[:nick_name]
    #@question.errors.add('Register: ', "Username is too short (minimum is 3 characters)<br/>") if nick_name.size < 3
    @error_msg << "Username is too short (minimum is 3 characters)<br/>" if nick_name.size < 3

    if @error_msg.empty? && !params[:password].empty?
        #@question.errors.add('Register: ', "Password is too short (minimum is 4 characters)<br/>") if params[:password].size < 4
        if params[:password].size < 4
            @error_msg << "Password is too short (minimum is 4 characters)<br/>"
        else
            @user = User.new
            @user.username = nick_name
            @user.password = params[:password]
            @user.password_confirmation = params[:password]
            if @user.save
              @question.update_attributes(:nick_name => nick_name)
              @question.update_attributes(:user_id => @user.id)
              @question.financial.update_attributes(:user_id => @user.id)
---
SELECT * FROM `questions` WHERE (`questions`.`id` = 1)
INSERT INTO `users` (`created_at`, `crypted_password`, `updated_at`, `username`, `password_salt`, `persistence_token`, `email`) VALUES('2010-10-21 01:37:39', 'a13f243ebc8bce71de52b5a21e5c17a1c714baa8a1eac37f7956cd6b5330b7c298cb06613f4303940755ae0576eb9e1b8f65f814267d9ede17e688579328d3a9', '2010-10-21 01:37:39', 'satishf', 'O9WBhXa5GkVxg778IuJK', 'de1b3c8ff5c3ec2075bfa52060bc9e68393ca3bf8d4d0786617dfc392ad45e2f54b0528adae00e1bb58c18a2720b2dd401865428628d9fb5f68e6d225b7506c5', NULL)
UPDATE `questions` SET `updated_at` = '2010-10-21 01:37:39', `user_id` = 1 WHERE `id` = 1
UPDATE `financials` SET `updated_at` = '2010-10-21 01:37:39', `user_id` = 1 WHERE `id` = 1