app/controllers/questions_controller.rb

SELECT * FROM `questions` ORDER BY created_at DESC
SELECT * FROM `users` WHERE (`users`.`id` = '1') LIMIT 1
---
  def index
    if current_user && current_user.username == 'admin'
      @questions = Question.find(:all, :order => 'created_at DESC', :limit => 5)
    else
      @questions = Question.find(:all, :conditions => ['nick_name != ? && expert_details is not NULL', "nickname"], :order => 'created_at DESC', :limit => 5)
    end

    #for the question
    if current_user && current_user.questions.size > 0

SELECT * FROM `questions` WHERE (`questions`.`id` = 1)
---
  def show
    @question = Question.find(params[:id])

SELECT * FROM `questions` WHERE (`questions`.`id` = 1)
---
  def get_expert_verdict
    begin
        @question = Question.find(params[:id])

INSERT INTO `notifications` (`created_at`, `updated_at`, `email`) VALUES('2010-10-21 01:07:17', '2010-10-21 01:07:17', 'test@gmail.com')
---
  def subscribe
    if current_user && current_user.username == 'hari'
      Notifier.deliver_notify_on_new_question(1)
    end
    if validate_simple_email(params[:subscriber_email])
      if Notification.find(:all, :conditions => ['email = ? && question_id = ?', params[:subscriber_email], 0]).empty?
        #Save this data
        Notification.create(:email => params[:subscriber_email])