app/controllers/responses_controller.rb

  def load_question
    @question = Question.find(params[:id])
---
SELECT * FROM `questions` WHERE (`questions`.`id` = 1)

  def create
    if params[:response][:verdict].nil? || params[:response][:reason].blank?
      @status_string = 'Please make sure to provide your response and reasoning.'
      @result = false
    else
      @response = Response.new(params[:response])
      @response.user_id = current_user.id
      @status_string = ""
      @result = false
      if @question.responses << @response
---
INSERT INTO `responses` (`question_id`, `created_at`, `verdict`, `updated_at`, `reason`, `user_id`) VALUES(1, '2010-10-19 03:50:53', 1, '2010-10-19 03:50:53', 'test', 3)