app/controllers/users_controller.rb

INSERT INTO `users` (`created_at`, `crypted_password`, `updated_at`, `username`, `password_salt`, `persistence_token`, `email`) VALUES('2010-10-19 03:50:45', '22bfca189624f8d779528807d247a4c4ef38eb6a3dd98e50ee6ababa0914e15cb042e50b9921dacae8328e001f8d121fe589971821e1f6a64d974dddb6c41bdf', '2010-10-19 03:50:45', 'test@gmail.com', '6dGWZSbepK79kSboe4Mz', 'd3ca4d1dc316683afed1153de9906b2dbed1b5fc295d31960b547075e990a7a49439be0e4ecc75af4d9531a927402bb12c351b68de659bd660590bdd672b4904', NULL)
---
   def create
     @user = User.new(params[:user])
     @user.password_confirmation = @user.password

     if @user.save